import math
import random

print("------------EASY------------")
print("------------Task 1------------")
s = ["яблоко", "банан", "киви", "арбуз"]

for i in range(4):
    print(f"{i+1}." + '{:>7}'.format(s[i]))

print("------------Task 2------------")

L1 = [1, 2, 3, 4, 4, 5]
L2 = [4, 5, 6]


for i in L1[:]:
    for j in L2[:]:
        if i == j:
            L1.remove(j)
print(L1)

# я не понимаю почему если писать "for i in L1:", то код не правильно работает


print("------------Task 3------------")
s = [19, 2, 8, 128, 11, 53, 64, 6]
k = 0
new_s = list()
for i in s[:]:
    if (i%2) == 0:
        i = i/4
    else:
        i = i*2
    new_s.insert(k, i)
    k = k + 1
print(new_s)

print("------------NORMAL------------")
print("------------Task 1------------")
s = [19, -9, 4, 256, 121, 53, 64, 6]
new_s = list()
for i in s:
   if i > 0 and (math.sqrt(i)) % 1 == 0:
        new_s.append(int(math.sqrt(i)))
print(new_s)

print("------------Task 2------------")
date = input("Введите дату dd.mm.yyyy: ")
date = (date.split('.'))
day = {'01':'первое',
       '02':'второе',
       '03':'третье',
       '04':'четвертое',
       '05':'пятое',
       '06':'шестое',
       '07':'седьмое',
       '08':'восьмое',
       '09':'девятое',
       '10':'десятое',
       '11':'одинадцатое',
       '12':'двенадцатое',
       '13':'тринадцатое',
       '14':'четырнадцатое',
       '15':'пятьнадцатое',
       '16':'шестьнадцатое',
       '17':'семнадцатое',
       '18':'восемнадцатое',
       '19':'девятнадцатое',
       '20':'двадцатое',
       '21':'двадцать первое',
       '22':'двадцать второе',
       '23':'двадцать третье',
       '24':'двадцать четвертое',
       '25':'двадцать пятое',
       '26':'двадцать шестое',
       '27':'двадцать седьмое',
       '28':'двадцать восьмое',
       '29':'двадцать девятое',
       '30':'дридцатое',
       '31':'тридцать первое'}
month = {'01':'января',
         '02':'февраля',
         '03':'марта',
         '04':'апреля',
         '05':'мая',
         '06':'июня',
         '07':'июля',
         '08':'августа',
         '09':'сентября',
         '10':'октября',
         '11':'ноября',
         '12':'декабря'}
print(f"Сегодня {day[date[0]]} {month[date[1]]} {date[2]} года.")

print("------------Task 3------------")
n = int(input("Введите кол-во элементов: "))
s = list()
for i in range(0, n):
    s.append(random.randint(-100, 100))
print(s)

print("------------HARD------------")
print("------------Task 1------------")

text = input("Введите текст: ").lower()
words = text.split(' ');
n = len(words)
g = 0
for i in text :
    if  i == "q" or i == "w" or i == "e" or i == "r" or i == "t" or i == "y" or i == "u" or i == "i" or i == "o" or i == "p" or i == "a" or i == "s" or i == "d" or i == "f" or i == "g" or i == "h" or i == "j" or i == "k" or i == "l" or i == "z" or i == "x" or i == "c" or i == "v" or i == "b" or i == "n" or i == "m":
       g += 1
print(f"В тексте {n} слов")
print(f"В тексте {g} английских букв")

print("------------Task 2------------")
text1 = input("Введите текст №1: ").lower().split(' ')
text2 = input("Введите текст №2: ").lower().split(' ')

res = list()

for i in text2:
    if i in text1:
        res.append(i)

res = list(set(res))

print("Вот слова которые есть и в 1м и во 2м тексте: ")
for i in res:
    print(i)